In [1]:
# eliminar duplicados en dataframe

import pandas as pd
import numpy as np

In [4]:
lista_valores = [[1,2], [1,2], [5,6], [5,8]]
lista_indices = list('mnop')
lista_col = ['valor1','valor2']
dataframe1 = pd.DataFrame(lista_valores, index = lista_indices, columns = lista_col)
dataframe1

   valor1  valor2
m       1       2
n       1       2
o       5       6
p       5       8

In [6]:
dataframe1.drop_duplicates()

   valor1  valor2
m       1       2
o       5       6
p       5       8

In [10]:
dataframe2 = dataframe1.drop_duplicates()
dataframe2

   valor1  valor2
m       1       2
o       5       6
p       5       8

In [9]:
dataframe2.drop_duplicates(['valor1']) # elimina el 5 repetido

   valor1  valor2
m       1       2
o       5       6

In [11]:
dataframe2.drop_duplicates(['valor1'], keep='last') # elimina el 5 repetido, quedandose con la sgunda columna repetida

   valor1  valor2
m       1       2
p       5       8